Revit 2026 API

# PrintManagerApply Method

---

Apply the local print settings to global for all documents.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Apply()
```
```vb
Public Sub Apply
```
```cpp
public:
void Apply()
```
```fsharp
member Apply : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others. |

This method will change the settings for the current printer to match what is set in the Print Manager. When the user attempts to print with this printer in the future, the changes made by the API session will be visible.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace